app/controllers/tasks_controller.rb

  def create
    @task = Task.new(title: params[:task][:title], description: params[:task][:description], due_date: params[:task][:due_date], complete: false)

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Do Laundry"], ["description", "do it"], ["complete", "f"], ["created_at", "2017-09-21 02:41:04.188910"], ["updated_at", "2017-09-21 02:41:04.188910"]]

  def update
    @task = Task.find(params[:id])

    @task.title = params[:task][:title]
    @task.description = params[:task][:description]
    @task.due_date = params[:task][:due_date]

    @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Updated: Practice yoga at minimum 3 times per week"], ["updated_at", "2017-09-21 16:49:23.084365"], ["id", 1]]

  def confirm_delete
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def delete
    @task = Task.find(params[:id])
    @task.delete
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]